#+title: Ch 05 Probabilistic Analysis And Randomised Algorithms
#+author: Erik An
#+email: obluda2173@gmail.com
#+date: <2026-04-14>
#+lastmod: <2026-04-14 20:20>
#+latex: \newpage
#+latex_header: \setlength{\parindent}{0pt}
#+latex_header: \setlength{\parskip}{1em}
#+latex_header: \usepackage{amsmath}
#+latex_header: \usepackage{amssymb}
#+latex_header: \usepackage{mathtools}
#+latex_header: \usepackage{amsthm}
#+latex_header: \usepackage[margin=1in]{geometry}
#+options: num:t tags:nil
#+property: header-args :eval never-export
#+startup: overview latexpreview inlineimages

* 5.1 The Hiring problem

- Interview $n$ candidates sequentially; hire whenever candidate $i$ beats current best
- Interview cost $c_i$, hiring cost $c_h$ (where $c_h \gg c_i$)
- Total cost: $O(c_i n + c_h m)$ where $m$ = number of hires
- Fixed $c_i n$ term → focus on analyzing $c_h m$

** Worst Case

- Candidates arrive in strictly increasing quality → hire all $n$
- Hiring cost: $O(c_h n)$

** Probabilistic Analysis

- Assume input drawn from a known distribution → compute *average-case running time*
- Hiring problem assumption: candidates arrive as a *uniform random permutation* — each of $n!$ orderings equally likely
- Requires knowledge/assumptions about input distribution; not always applicable

** Randomized Algorithms

- When input distribution is unknown: inject randomness into the algorithm itself
- Modified hiring: receive candidate list in advance, randomly permute interview order
- Behavior depends on input + output of RNG → *randomized* algorithm
- $\texttt{RANDOM}(a, b)$: returns integer in $[a, b]$ uniformly; independent calls
- Running time analyzed as *expected running time* (expectation over RNG), not over inputs

** Key Distinction

|                        | Source of randomness | Analysis type             |
|------------------------+----------------------+---------------------------|
| Probabilistic analysis | Input distribution   | Average-case running time |
| Randomized algorithm   | Algorithm's RNG      | Expected running time     |

* 5.2 Indicator random variables

** Definition

Given sample space $S$ and event $A$:

$$I\{A\} = \begin{cases} 1 & \text{if } A \text{ occurs} \\ 0 & \text{otherwise} \end{cases}$$

*** Lemma 5.1

$E[X_A] = \Pr\{A\}$

Proof: $E[I\{A\}] = 1 \cdot \Pr\{A\} + 0 \cdot \Pr\{\bar{A}\} = \Pr\{A\}$

** Key Property: Linearity of Expectation

$E\left[\sum_{i=1}^{n} X_i\right] = \sum_{i=1}^{n} E[X_i]$

- Holds *even when $X_i$ are dependent*
- Converts hard counting problems into sum of easy per-event probabilities

** Coin Flip Example

$X_i = I\{\text{flip } i \text{ is heads}\}$, $X = \sum X_i$

$$E[X] = \sum_{i=1}^{n} \frac{1}{2} = \frac{n}{2}$$

** Application to Hiring Problem

$X_i = I\{\text{candidate } i \text{ is hired}\}$, $X = \sum_{i=1}^{n} X_i$

- Candidate $i$ is hired iff best among first $i$ → $\Pr\{\text{hired}\} = 1/i$
- $E[X_i] = 1/i$

*** Expected number of hires

$$E[X] = \sum_{i=1}^{n} \frac{1}{i} = \ln n + O(1) = H_n$$

*** Lemma 5.2

Under uniform random permutation of candidates, HIRE-ASSISTANT has average-case hiring cost $O(c_h \ln n)$.

(vs. worst-case $O(c_h n)$)

*** Code

#+begin_src julia :results value
using Random

function count_hires(n)
    best = 0
    hires = 0
    for candidate in randperm(n)
        if candidate > best
            hires += 1
            best = candidate
        end
    end
    hires
end

function simulate(n, epochs)
    sum(count_hires(n) for _ in 1:epochs) / epochs
end

simulate(100, 1_000_000)
#+end_src

#+RESULTS:
: 5.188858
